// 4. Отсортируйте время согласно заданному критерию. (2 бала)
// Сначала задано число n (1 ≤ n ≤ 100), а затем n моментов времени.
// Каждый момент времени задается 3 целыми числами - часы (от 0 до 23), минуты (от 0 до 60) и секунды (от 0 до 60).
//
// Входные данные #1
// 4
// 10 20 30
// 7 30 00
// 23 59 59
// 13 30 30
//
// Выходные данные #1
// 7 30 0
// 10 20 30
// 13 30 30
// 23 59 59

let moments = [
    [10, 20, 40],
    [10, 20, 30],
    [7, 30, 0],
    [23, 59, 59],
    [7, 30, 59],
    [13, 30, 30]
];

console.log(moments.sort((a, b) => {

    if (a[0] !== b[0]) {
        return a[0] - b[0];
    } else if (a[1] !== b[1]) {
        return a[1] - b[1];
    } else if (a[2] !== b[2]) {
        return a[2] - b[2];
    } else {
        return 0;
    }
}));